package com.startsmake.novel.bean;

import com.startsmake.novel.bean.db.ChapterContent;

/**
 * User:Shine
 * Date:2015-08-25
 * Description:
 */
public class NovelBodyBean {

    /**
     * chapter : {"title":".","body":"\u201c叮\u2014\u2014\u201d\n\u201c空间兑换成功，积分减少三千，剩余五十，请玩家做好准备\u2026\u2026\u201d\n葵花清醒的时候明显感觉不对，睁开眼果然发现处境不妙。\n夜黑风高，天上几粒微暗的星星，胳膊腿都被绳子绑起来，口中被塞着来源不明的破布。更不妙的是，面前几个嘻嘻哈哈的小青年，摇晃着闪光的智能手机拍拍拍，口中吐着污秽的词句。\n\u201c阿敏，这次的货色比之前的小妮子漂亮多了呢～\u201d顶着一头黄毛的青年眼里满是yin邪。\n\u201c可不是，新转来的小学妹，难得清纯的小鲜肉呀～阿敏可真是有魅力。\u201d这次出声的是个挂满耳钉的瘦高少年，双手解腰带，急不可耐的模样。\n\u2026\u2026\n还有几个少年，虽然天太黑看不清长相，但同样的动作让葵花瞬间明白了当前情况。\n葵花手指微动，藏在空间的匕首出现手中，只一个眨眼，匕首翻了几个花，捆着手腕手臂和身体的麻绳齐齐断裂，金属的尖刃在星光与手机灯光里闪着冷光。\n最靠近葵花的黄毛青年笑容僵在脸上，转瞬就被撂倒在地。\n忽然的变故让一众欲行不轨的青少年全部愣住，葵花体内一阵燥热，多次任务后她对这yu火浑身感觉并不陌生，只是来的太突然太剧烈\u2014\u2014竟然是被用了药。\n葵花咬破了舌尖保持清明，少女软弱的身体使不出多少力气，只制服一个黄毛就费了她许多精力。葵花不敢恋战，从空间抓了一大把迷幻粉，迎风一抖，七八个青少年就如石头一般倒地。\n又从空间取了清心丸服下，葵花吐了一口气，眼风扫了一眼战场，用绳子将几人捆在一起，捞起明显属于女孩子的粉色兔子背包背上，另外一个还有粉色外壳的手机。\n葵花站在学校门口，看着烫金大字\u201c美德私立中学\u201d冷笑出声。\n美德，简直是没德才对。\n手机铃声响起，葵花一看，来电人是\u201c最爱的妈咪\u201d。\n\u201c葵花你在哪儿？妈妈以为你睡着了，你晚上怎么不在家！急死妈妈了\u2026\u2026\u201d女人焦急又惊慌的声音似乎要穿透手机。\n葵花整理了情绪，乖巧又软糯的少女声音回答\u201c妈妈，我和雅苑约了吃甜点，正要回家呢。\u201d\n\u201c我来接你。\u201d\n\u201c不用，很近的，我马上就到家门口了。\u201d\n葵花是穿梭于各种影视与文章中的任务人，完成其中某个角色的心愿来获取积分，积分可以向发布任务的系统兑换物品，比如奇怪的药粉、奇特的武器以及昂贵的空间。这一次葵花用大大小小几十次任务积攒的三千积分，换了三亩地大小的小天地。葵花本是肉疼得不行，不过就本次任务来看，有个空间再方便不过。\n这一回的任务对象是个名叫李葵花的初二女生，是女主角苏素珍的女儿。\n苏素珍的丈夫与一身材面容皆上等的女律师有婚外情，自然就瞧着家庭主妇黄脸婆不顺眼，苏素珍各种妥协也无用之后，两人便离了婚。女律师当然不愿当后妈，苏素珍也舍不得女儿，李葵花便跟了亲娘过日子。本来该平分的财产，在女律师舌灿莲花之下，苏素珍只得了不到三分之一。\n苏素珍心中苦闷，带着女儿到了城市的北城区，与原居的南边隔了老远。她向来宠女儿，要去的学校当然得是这个区最好的学校。\n而这所学校，就是悲剧的起源。\n李葵花性子天真烂漫，长得又十分标致，才转学就收到多封情书，这其中，竟然也包括高中部的校草学神陈郁敏。\n然而她一点儿也不知道，陈郁敏有种怪异的爱好，还有一群爱采花的好兄弟。\n李葵花收到陈郁敏的第一次约会消息乐开了花，完全不顾朋友的劝阻，在只有星光的黑夜里去了学校天台。只可惜，等待她的并不只有白马王子，而是一群带她下地狱的狼。\n母亲苏素珍仔细打扮了妆容其实很出色，女儿受ru这天晚上正是男同事从南边追过来表白，环境有点儿吵她有些心绪不宁，竟然没有听见女儿求救的电话，待她拨过去，只有少女痛苦的尖叫哭泣和男人露骨的调戏，以及rou体的撞击声。\n母亲顿时手脚冰凉。\n等苏素珍再见到女儿，李葵花已经是神志不清昏迷在医院，身上满是欢爱受nue过后的青红紫绿。\n待她清醒，活泼外向的女孩子沉默如同老妪，双眼无神的女儿总是浸泡在浴缸里，不断的喃喃\u201c洗不干净呀怎么都洗不干净\u2026\u2026\u201d\n这样的女儿让苏素珍几欲发狂，她恨不得那几个畜生去死。\n所以那几个畜生的父母来找她私了的时候她不答应。\n她要给女儿一个公道。\n人都言，法律是公平的。\n她带着女儿在众人面前，只求一个公道。而结果只是让女儿再次回忆痛苦，如同在众人面前赤果果的扎自己一刀。\n畜生不被判罪的理由是未成年。\n未成年。\n她不服，就算去求前夫的现任律师妻子，她也要让那些畜生死。\n只是，还没来得及。\n没被判罪并不是结束，采了许多花的少年们从没有被揭露过，或者是女孩子们为了名声忍了，或者是忌惮少年们的家里有着权势。李葵花是第一个让他们恼怒的，所以得受着接下来的报复。\n李葵花死了。\n在放满水的浴缸里。少女满身的青紫，浸泡在血红的冷水里，手腕上有深深的切口。\n苏素珍哭得歇斯底里。\n想要好好的养个孩子，怎么就这么难。\n苏素珍在李葵花的手机里发现了几个畜生的欺负女儿的视屏，以及再次诓她侮辱她，逼着她脱光了衣服，赤身裸体拉她最爱的大提琴，被辱骂被要求对着镜头笑，却只有一个麻木的哭脸后。\n从震惊到愤怒到发狂，不过就一瞬间。\n美德中学的男学生在短时间里接二连三的死去，残肢断臂，生殖器被碎，极为血腥残忍，震惊全国。而这死去的少年里面包括了两名官二代，几个富二代。\n嫌疑犯被发现时仍在作案，苏素珍最后才发现，主谋竟然是女儿常常提起的男朋友陈郁敏。\n苏素珍恨透了诓她女儿的陈郁敏，所谓的校草学神不过是头披着兽皮的畜生。亏得女儿李葵花还当他是心头宝。\n女儿的大仇已报，苏素珍没了遗憾，在行凶当场被击毙，留下一个杀人如麻的变态刽子手骂名。\n谁也不曾关注，她曾经是个温柔贤淑的妻子，她只是个爱护女儿的母亲，想和女儿一起开个蛋糕店，过简单日子的母亲。\n李葵花的心愿，就是自己不被玷污，母亲就不会发狂，能守着母亲好好过完一生，还要让曾经侮辱过她的人不得好死。\n前两个心愿不难，最后一个也不算难，要神不知鬼不觉弄死个把人，对于拥有空间和兑换系统的葵花来说分分钟的事儿。\n按照原主的记忆回到家。\n焦急心慌的苏素珍打开门看到的是提着小蛋糕全身无恙的宝贝女儿，立即安心，数落了几句见女儿说累，也就不唠叨了。\n葵花进了李葵花的房间打开课本写作业，初二的课程于她来说并不难，虽然李葵花没有要求，葵花还是决定考个好成绩，让苏素珍心情愉快。最主要的是，弄死了那几个畜生后，葵花想带苏素珍换个城市过日子，那会儿该是考大学的时候了，苏素珍很羡慕别人家的孩子能考入京都大学。女儿向来成绩中等，能考入京都的二流大学她就满足了，这是苏素珍挂在嘴边的话。\n九点的样子葵花就躺在床上装睡，李葵花的作息很规律。晚一会苏素珍过来给她掖被子，还在额头上亲了一下才走。这种毫不掩饰的关怀让葵花有些仓皇。\n静下心，葵花开始研究跟系统兑换的空间，除了可以存各种物品之外，这三亩地还是一片自成空间的小天地。\n坐北向南一个农家小院，四周有各种果树，不同季节的果子同时开花，院子不远处有条不宽的河流。令葵花惊讶的是，空间里有浓郁的灵气。葵花曾去过修仙的世界做任务，这空间的灵气竟然比得上大门派里最要紧的洞天福地。\n三千多的积分果然物有所值。\n葵花几个吐纳呼吸，就能感觉到原主柔弱的身体舒畅了许多。这一夜葵花便索性在空间里打坐，力求尽快让身体结实起来，至少碰见登徒子也不会没有还手之力。\n感觉快天亮的时候葵花准备出来，又觉得空间有些冷清，便用剩下的五十个积分兑换了一些小鸡，鸭子，小鹅，一些鱼苗，还有一只黑猫崽，一条黄色中华田园犬幼崽。\n系统好心赠送了一只老鼠，据说是偷奸耍滑的最佳帮手。\n葵花无语，老鼠却很有灵性地绕着她的脚边转圈子。\n看着小老鼠黝黑闪亮的小眼睛，葵花忽然就有了个点子，虽然计划报仇的时间拉得很长，但也可以从现在开始。\n(本章完)"}
     * ok : true
     */
    private ChapterContent chapter;
    private boolean ok;

    public void setChapter(ChapterContent chapter) {
        this.chapter = chapter;
    }

    public void setOk(boolean ok) {
        this.ok = ok;
    }

    public ChapterContent getChapter() {
        return chapter;
    }

    public boolean isOk() {
        return ok;
    }

}
